import React from "react";
import * as Accordion from "@radix-ui/react-accordion";
import {
  AccordionContent,
  AccordionItem,
  AccordionTrigger,
} from "@/components/accordion-component";

const AboutUsAccordionSection = () => {
  return (
    <div className="container !outline-0 mt-[20px] md:mt-[60px]">
      <Accordion.Root
        className="w-full"
        type="single"
        collapsible
        defaultValue="item-1"
      >
        <AccordionItem value="item-1">
          <AccordionTrigger>
            <div>
              Створюємо освітні молодіжні простори, щоб надихати молодь
              навчатися.
            </div>
          </AccordionTrigger>
          <AccordionContent>
            Наша громадська організація спрямована на створення інноваційних
            освітніх просторів для молоді, які стимулюють інтерес до навчання та
            саморозвитку. Ми використовуємо сучасні методи навчання, що
            включають STEAM (наука, технології, інженерія, мистецтво та
            математика), які сприяють розвитку критичного мислення та вирішення
            проблем. Такі простори не лише надають молоді знання, а й створюють
            середовище для креативного підходу до навчання, дозволяючи їм
            експериментувати, досліджувати і втілювати свої ідеї у життя. Ми
            віримо, що навчання повинне бути не лише корисним, а й цікавим,
            інтерактивним та адаптованим до сучасних потреб.
          </AccordionContent>
        </AccordionItem>

        <AccordionItem value="item-2">
          <AccordionTrigger>
            <div>Синергія для розвитку інновацій та підприємництва молоді.</div>
          </AccordionTrigger>
          <AccordionContent>
            Ми активно розробляємо та впроваджуємо проєкти, які допомагають
            молоді отримувати практичні навички у технічних спеціальностях та
            розвивати підприємницьке мислення. Ці проєкти включають навчальні
            курси, воркшопи, інкубатори інновацій та інші ініціативи, спрямовані
            на розвиток креативних та технічних здібностей у молоді. Ми прагнемо
            створити платформу, де молодь зможе спілкуватися з експертами різних
            галузей, обмінюватися ідеями, працювати над реальними проєктами та
            створювати власні стартапи. Наші проєкти допоможуть юним
            винахідникам не тільки здобути нові знання, а й перетворити свої
            ідеї на успішні бізнес-моделі, які сприятимуть економічному та
            соціальному розвитку України.
          </AccordionContent>
        </AccordionItem>

        <AccordionItem value="item-3">
          <AccordionTrigger>
            <div>
              Ми хочемо відповідати концепціям нашої держави з розвитку освіти.
            </div>
          </AccordionTrigger>
          <AccordionContent>
            Наші освітні ініціативи повністю узгоджуються з національною
            стратегією розвитку освіти, яка орієнтована на інновації, технології
            та інтеграцію нових методів навчання. Ми прагнемо зробити освіту
            доступною для кожного, сприяючи впровадженню новітніх технологій та
            практик у навчальний процес. Наші проєкти покликані підтримувати
            державну політику у сфері освіти, допомагаючи інтегрувати українську
            молодь у світовий ринок праці, де знання у сфері науки та технологій
            є ключовими. Наша мета — підготовка нового покоління лідерів, які
            будуть здатні відповідати викликам сучасного світу і сприяти
            розвитку країни.
          </AccordionContent>
        </AccordionItem>
      </Accordion.Root>
    </div>
  );
};

export default AboutUsAccordionSection;
