export const partnersList = [
  {
    title: "ВМК-Україна",
    href: "",
    logo: "",
    description:
      "Бізнес, який найпершим підтримав ГО, коли у нас навіть не було кінцевої ідеї чим ми будемо займатися. Із вогником в очах ми звернулися з проханням надати нам трошки столів та 2 шафи для зберігання майбутніх речей.",
  },
  {
    title: "Bodro Clinic",
    href: "",
    logo: "",
    description:
      "Бізнес, який найпершим підтримав ГО, коли у нас навіть не було кінцевої ідеї чим ми будемо займатися. Із вогником в очах ми звернулися з проханням надати нам трошки столів та 2 шафи для зберігання майбутніх речей.",
  },
  {
    title: "Rosa",
    href: "",
    logo: "",
    description:
      "Бізнес, який найпершим підтримав ГО, коли у нас навіть не було кінцевої ідеї чим ми будемо займатися. Із вогником в очах ми звернулися з проханням надати нам трошки столів та 2 шафи для зберігання майбутніх речей.",
  },
  {
    title: "ГО «МРЦ «Нові крила»",
    href: "",
    logo: "",
    description:
      "Бізнес, який найпершим підтримав ГО, коли у нас навіть не було кінцевої ідеї чим ми будемо займатися. Із вогником в очах ми звернулися з проханням надати нам трошки столів та 2 шафи для зберігання майбутніх речей.",
  },
  {
    title: "ГО «Молодіжна платформа»",
    href: "",
    logo: "",
    description:
      "Активно підтримували нас та Нововолинську міську раду під час створення молодіжного центру «4.0»\n",
  },
  {
    title: "Нововолинська міська рада.",
    href: "",
    logo: "",
    description: "Спільно створити комунальну установу «Молодіжний центр «4.0»",
  },
];
